[
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n In this lesson, students learn what value investing is.  The three course objectives are: 1) The difference between value trading and value investing 2) The difference between an asset and a liability 3) Who created and uses value investing.",
    "duration": 1,
    "name": "1. What is Value Investing?",
    "position": 0,
    "provider_id": "KfDB9e_cO4k",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "1-what-is-value-investing",
    "thumbnail_url": "https://i.ytimg.com/vi/KfDB9e_cO4k/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, students learn about Net Income, Total Revenue, Cost of Revenue, and very basic valuation techniques.",
    "duration": 1,
    "name": "2. Value a Small Business like Warren Buffett",
    "position": 1,
    "provider_id": "vJASGyPn-vg",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "2-value-a-small-business-like-warren-buffett",
    "thumbnail_url": "https://i.ytimg.com/vi/vJASGyPn-vg/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn lesson three, we explored the importance of a Balance Sheet.  We learned that current assets and liabilities are income streams and obligations, respectively, that a company will receive or pay during the next 12 months.  We also learned that the equity of a business was equal to the total assets minus the total liabilities.  After determining a company's equity, we can use that important number to determine the margin of safety that's associated with buying a business.",
    "duration": 1,
    "name": "3. What is a Balance Sheet and Margin of Safety",
    "position": 2,
    "provider_id": "yfWbSbrKkcQ",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "3-what-is-a-balance-sheet-and-margin-of-safety",
    "thumbnail_url": "https://i.ytimg.com/vi/yfWbSbrKkcQ/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn lesson four, we learned that a share of a business is one unit of the overall business.  For example, if an ice cream stand business was worth $100,000 dollars and the owner divided the company into 10,000 shares, each share would be worth $10.  In this scenario, the 10,000 shares that the company would be divided into would be called the shares outstanding.\n\nJust like a business, that becomes more or less valuable, 1 share of a business will do the same.  Although we have only learned basic valuation techniques during the three previous lessons, we know that the earnings per share (EPS) -or just earnings- is one of the most important term to understand.  The earnings per share (EPS) essentially tells us the profit that 1 share has made in a 1 year period.  \n\nAlso, we learned that the book value (or equity per share) is a very important term because it provides the value of 1 share if the business stopped operations.  A comparison of the book value and trading price (or market price) determines our margin of safety on each investment\n\nDuring the video, we learned that it is important to look at 1 share as if it were a mini-business, because itís easy to proportionally look at the value of the entire business that way.   We also learned that owning 1 share is no different than owning the entire business.",
    "duration": 1,
    "name": "4. What is a Share",
    "position": 3,
    "provider_id": "csy91a1iDKU",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "4-what-is-a-share",
    "thumbnail_url": "https://i.ytimg.com/vi/csy91a1iDKU/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\nThis video is a practical exercise that shows students of the BuffettsBooks.com website how to find the terms they've been learning about in the first 4 lessons of Course 1, Unit 1.",
    "duration": 1,
    "name": "4 (PE). Finding Basic Stock Terms",
    "position": 4,
    "provider_id": "PUvkPoDavnI",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "4-pe-finding-basic-stock-terms",
    "thumbnail_url": "https://i.ytimg.com/vi/PUvkPoDavnI/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn lesson five, we learned that Warren Buffett has four rules that he uses for investing in stocks.  All the rules must be met in order for him to purchase shares of a company.  Those four rules are the following:\nRule 1: A stock must be stable and understandable\nRule 2: A Stock must have long term prospects\nRule 3: A Stock must be managed by vigilant leaders\nRule 4: A Stock must be undervalued\nWe also learned a very basic valuation technique that Warren Buffett used when he worked for Benjamin Graham.  The technique multiplies the P/E ratio by the P/BV ratio and the result needs to be lower than 22.5.  \nA key fundamental of Warren Buffett stock basics is the idea that the stock market is nothing more than a location where he can buy or sell his shares.  The market only provides a platform for him to purchase undervalued companies.  He always buys on the assumption that they stock market could close tomorrow and not open for five years ñ and it would have no impact on his decision to buy a particular company.\nFinally, we learned that Warren Buffett possess great patience.  He never tries to make enormous gains, but instead consistent gains at reasonable levels.  He always thinks for himself and always determines the value of a stock based on what HE thinks a company is worth - not the market.",
    "duration": 1,
    "name": "5. Warren Buffett Stock Basics",
    "position": 5,
    "provider_id": "_uQjGz6jp2E",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "5-warren-buffett-stock-basics",
    "thumbnail_url": "https://i.ytimg.com/vi/_uQjGz6jp2E/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, we first learned that a bond is nothing more than a loan.  There are many forms of bonds that a person can invest in, but the four primary forms are corporate bonds, Municipal Bonds, State Bonds, and Federal Bonds.  We know there are inherent risks associated with purchasing a bond, but many of them can be mitigated by treating the investment as if you were a bank lender.\n\nWe learned that Bonds can be a very lucrative investment as long as you purchase the security (or bond) at a strong yield and minimal risk.  If you're purchasing a bond as a long term investment, we know that it's market price will be more volatile during the first 15 years as interest rates change.  Intelligent investors can take advantage of these price fluctuations is they know how to properly value the bonds.",
    "duration": 1,
    "name": "6. What is a Bond",
    "position": 6,
    "provider_id": "cWzgk-8QHKk",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "6-what-is-a-bond",
    "thumbnail_url": "https://i.ytimg.com/vi/cWzgk-8QHKk/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, we first learned about the primary components of a bond.  We learned that the par value or face value is the price the bond was originally issued for.  It's also the price that will be repaid to holder of the bond when it matures.  \nThe next component we learned about was the coupon.  The coupon is the amount of money that the bond holder will receive from the issuing company for what every rate the bond specifies.  For example, if a $1,000 par bond pays a $25 coupon biannually.  The investor (or bond holder) can expect a 5% return on their money.  This would be determined by summing the two coupon payments for the year and then dividing the annual coupons by the par value.\nThe last component we learned about was the term of the bond.  Just like a standard loan, borrowed money has a term in which the loan will be repaid.  This duration is called the term.\nAfter a bond is issued, the owner of the security (or bond) has the ability to sell the bond on a market.  When the owner attempts to sell the bond, the price at which they offer to sell the investment is called the market price.  Since the value of a bond is inversely proportional to current interest rates, the market price of a bond will increase as interest rates decrease, and vice versa.  More information on basic valuation techniques are taught in the following lesson.",
    "duration": 1,
    "name": "7. What are the components of a bond",
    "position": 7,
    "provider_id": "KQ2bfwHMrnM",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "7-what-are-the-components-of-a-bond",
    "thumbnail_url": "https://i.ytimg.com/vi/KQ2bfwHMrnM/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\nIn this lesson, we began to understand the important terms that truly value a bond. Since most investors will never hold a bond throughout the entire term, understanding how to value the asset becomes very important. As we get into the second course of this website, a thorough understanding of these terms is needed. So, be sure to learn it now and not jump ahead.\n\nWe learned that there are two ways to look at the value of a bond, simple interest and compound interest. As an intelligent investor, you'll really want to focus on understanding compound interest. The term that was really important to understand in this lesson was yield to maturity. This term was really important because it accounted for almost every variable we could consider when determining the true value (or intrinsic value) of the bond. Yield to Maturity estimates the total amount of money you will earn over the entire life of the bond, but it actually accounts for all coupons, interest-on-interest, and gains or losses you'll sustain from the difference between the price you pay and the par value.",
    "duration": 1,
    "name": "8. Value a Bond and Calculate Yield to Maturity (YTM)",
    "position": 8,
    "provider_id": "pfhjJ00IuW4",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "8-value-a-bond-and-calculate-yield-to-maturity-ytm",
    "thumbnail_url": "https://i.ytimg.com/vi/pfhjJ00IuW4/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\nIn Unit 3, Lesson 1, we learned what a stock market is.  Although many people might not view a stock market the same way as a food market, they're actually more related than you might think.  Like any market, in order for a trade to occur, there always needs to be a buyer and a seller.  When sellers outnumber the buyers, the market is considered a buyer's market.  This means that the buyers are the ones that are moving the market price of the stock.  But when the buyers outnumber the sellers, the market is considered a seller's market.  This means that the sellers are the ones moving the market price of a stock.\n\nThe selling and buying of 1 share, leads to the methods investors use to conduct trades.  We first learned about a stop order.  Here's information for the securities exchange commission on the proper understanding of a Stop Order:\n\nA stop order, also referred to as a stop-loss order, is an order to buy or sell a stock once the price of the stock reaches a specified price, known as the stop price. When the stop price is reached, a stop order becomes a market order. A buy stop order is entered at a stop price above the current market price. Investors generally use a buy stop order to limit a loss or to protect a profit on a stock that they have sold short. A sell stop order is entered at a stop price below the current market price. Investors generally use a sell stop order to limit a loss or to protect a profit on a stock that they own. Before using a stop order, investors should consider the following: \n\n\nShort-term market fluctuations in a stock's price can activate a stop order, so a stop price should be selected carefully. The stop price is not the guaranteed execution price for a stop order. The stop price is a trigger that causes the stop order to become a market order. The execution price an investor receives for this market order can deviate significantly from the stop price in a fast-moving market where prices change rapidly. An investor can avoid the risk of a stop order executing at an unexpected price by placing a stop-limit order, but the limit price may prevent the order from being executed. Some brokerage firms have different standards for determining whether a stop price has been reached. For these stocks, some brokerage firms use only last-sale prices to trigger a stop order, while other firms use quotation prices. Investors should check with their brokerage firms to determine the specific rules that will apply to stop orders. \n\nThe next type of order is a limit.  Here is the definition and example from the securities commission:\n\nA limit order is an order to buy or sell a stock at a specific price or better. A buy limit order can only be executed at the limit price or lower, and a sell limit order can only be executed at the limit price or higher. A limit order is not guaranteed to execute. A limit order can only be filled if the stock's market price reaches the limit price. While limit orders do not guarantee execution, they help ensure that an investor does not pay more than a pre-determined price for a stock. \n\nExample: An investor wants to purchase shares of ABC stock for no more than $10. The investor could place a limit order for this amount that will only execute if the price of ABC stock is $10 or lower.\n\nAs buyers and sellers move the market price of a stock through the use of these orders, the market will offer great deals or very expensive prices.  This idea is represented by Benjamin Graham's Mr. Market.  Graham used the idea of Mr. Market to represent a stubborn business partner that sometimes offers great deals or horrible prices.  Your job as an intelligent investor is to determine which deals are of great value.  Don't worry, if you stick with the lesson plan here at Buffett's Books, you'll learn the methods of Warren Buffett and Benjamin Graham.",
    "duration": 1,
    "name": "9. What is the Stock Market",
    "position": 9,
    "provider_id": "v6zhQuGCfoM",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "9-what-is-the-stock-market",
    "thumbnail_url": "https://i.ytimg.com/vi/v6zhQuGCfoM/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn Unit 3, Lesson 2, we learned about psychology of the stock market and how most traders rely on instincts opposed to value in order to conduct trading.  We learned a very important quote from Benjamin Graham that states, ìThe stock Market behaves like a voting machine, but in the long term it acts like a weighing machine.î  This idea is important for value investors to understand as they remain confident in their valuation of any asset during emotional times.  \n\nDuring this lesson, we provided a demonstration of an emotional trader and a value trader.  As you could see in the video, the value trader almost always had the opposite opinion of the emotional trader.  This is important to remember as you move into the second course of this website.  Determining the intrinsic value of a stock will help provide a peace of mind and ability to make clear decisions.",
    "duration": 1,
    "name": "10. Stock Market Crash and Market Bubbles",
    "position": 10,
    "provider_id": "Edx5UR4yFOo",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "10-stock-market-crash-and-market-bubbles",
    "thumbnail_url": "https://i.ytimg.com/vi/Edx5UR4yFOo/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nThe FED is short for the U.S. Federal Reserve.  The mission of the FED is to care for the U.S. economy.  They do this through four different objectives.  First they try to ensure maximum employment through price stabilization.  Second, they supervise and regulate banks.  Third, they maintain stability of the financial system by adjusting interest rates.  Fourth, they service the debt obligations for the federal government.\n\nIn this lesson, we really focused on the third objective: Maintaining stability of the financial system.  In order for the FED to stabilize the economy, they have to constantly adjust the interest rate at which banks can lend money to citizens and businesses.  By doing this, the FED is ultimately controlling the spending habits of the U.S. economy.  When the FED controls interest rates, it provides predictable investment opportunities for value based investors because they are able to capitalize on the changing market prices of stocks and bonds.  \n\nWe learned that when interest rates are high, we'll want to focus our efforts on finding quality bonds.  By taking this strategy, a value investor can collect high paying coupons and also prepare themselves for a profitable venture when interest rates decrease.  Since the value of a bond increases when interest rates decrease, the market value will undoubtedly increase on a long term bond when market crashes force the FED to drop interest rates.\n\nWe also learned that when interest rates are low, it's probably a good time to find undervalued stocks.  The most lucrative time to buy stocks is during a recession because scared investors are selling their shares at a discount price.  Smart investors need to ensure that they always avoid buying companies with marginal levels of debt.  In course two, this site conducts a thorough review of all the information you need to properly assess the intrinsic value of stocks and bonds.  The key point to take away is that when interest rates are low, you want to ensure that you're buying stocks.\n\nIn the end, we learned that the FED actually provides great clues as to the position of Mr. Market.  We know that when interest rates are high, the stock market is experiencing a greed cycle.  Likewise, when interest rates are low, the stock market is experiencing a fear cycle.  This information proves very valuable as value investors capitalize on market movements and opportunities.",
    "duration": 1,
    "name": "11. What is the FED",
    "position": 11,
    "provider_id": "2QGqXeDOkIU",
    "published_at": "2012-05-30T14:20:10Z",
    "slug": "11-what-is-the-fed",
    "thumbnail_url": "https://i.ytimg.com/vi/2QGqXeDOkIU/maxresdefault.jpg"
  },
  {
    "course": "course-1-stock-investing-like-warren-buffett-beginners",
    "description": "Economics 101 -- \"How the Economic Machine Works.\"\n\nCreated by Ray Dalio this simple but not simplistic and easy to follow 30 minute, animated video answers the question, \"How does the economy really work?\" Based on Dalio's practical template for understanding the economy, which he developed over the course of his career, the video breaks down economic concepts like credit, deficits and interest rates, allowing viewers to learn the basic driving forces behind the economy, how economic policies work and why economic cycles occur.\n\n\nTo learn more about Economic Principles visit: http://www.economicprinciples.org.\n\n\n[Also Available In Chinese] 经济这台机器是怎样运行的: http://www.youtube.com/watch?v=-ZbeYejg9Pk\n\n[Also Available In Russian] Как действует экономическая машина. Автор: Рэй Далио (на русском языке): http://youtu.be/8BaNOlIfMLE\n\nFor more from Ray:\nPrinciples | #1 New York Times Bestseller: https://amzn.to/2JMewHb \nBuy his new book, Principles for Success: https://amzn.to/34lgnNJ\nConnect with him on Facebook: https://www.facebook.com/raydalio\nFollow him on Twitter: https://www.twitter.com/raydalio\nFollow him on Linkedin: https://www.linkedin.com/raydalio\nFollow him on Instagram: https://www.instagram.com/raydalio/\nDownload his free iOs app: https://principles.app.link/PFS",
    "duration": 1,
    "name": "How The Economic Machine Works by Ray Dalio",
    "position": 12,
    "provider_id": "PHe0bXAIuk0",
    "published_at": "2015-08-18T11:43:46Z",
    "slug": "how-the-economic-machine-works-by-ray-dalio",
    "thumbnail_url": "https://i.ytimg.com/vi/PHe0bXAIuk0/maxresdefault.jpg"
  }
]