[{"name": "12. What is Financial Risk", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, we briefly talked about the difference between risks and rewards.  We learned that the 10 year Federal Note is a risk free investment that provides a marginal return.  We know that in follow on lessons, we're going to use the 10 year note as our baseline value to relatively compare the value of other investments.\nWhen we assess the amount of risk that's associated with an investment, we learned about three factors that make an investment risky.\n1.  Debt.  We learned that as a company increases the amount of debt (or leverage) they use, it typically results in diminishing returns.  By avoiding investments that carry a lot of debt, you'll mitigate the risks associated with any investment.\n2.  Price.  Although investors might have the opportunity to purchase a really great business, we learned that the price at which they purchase the asset can actually result in a poor investment.  We know that the price is what we pay and that value is what we get.  This idea is at the heart of a value based investing approach.\n3.  Knowledge.  One of the hardest things for an investor to do is to admit that they don't know all the facts.  Although this may prove challenging, the faster an investor can identify they lack of knowledge or ability to properly account for all the variables, the less risk they'll assume in any investment.", "thumbnail_url": "https://i.ytimg.com/vi/-4mXnFK0ecM/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "-4mXnFK0ecM", "duration": 1, "position": 0, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "12-what-is-financial-risk"}, {"name": "13. What is Inflation", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\nIn this lesson, students learned about the impacts of inflation.  By understanding what causes inflation, we can then understand how it destroys the yield of a loan and maintains the value of corporate ownership.\n\nWe learned that inflation is generally caused when the government increases the supply of money in the financial system.  When this occurs, members of the system have more money to spend and the price of goods and services go up.\n\nThis increase in price can drastically destroy a long term investment if the investor doesn't account for the compounding inflation rate.\n\nThe most important thing you can learn from this lesson are the two following points:\n\n1. Bonds are completely affected by inflation.\n2. Stocks are not necessarily affected by inflation.", "thumbnail_url": "https://i.ytimg.com/vi/edJPodRQ7Z0/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "edJPodRQ7Z0", "duration": 1, "position": 1, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "13-what-is-inflation"}, {"name": "14. What is the S&P Rating", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, we learned about the three different credit organizations that rate a company's debt.  Those three organizations are Standard and Poors, Fitch, and Moody's.\n\nAlthough each of these organization do the same thing, we learned that the scoring techniques and accuracy is different.\n\nIt's very important to understand the risks associated with each credit rating, and that's why we compared the chance of default to the letter score.  \n\nUnderstanding the chance of default provides an investor actual data to determine their appetite for risk.  \n\nWhen assessing the risk between a corporate bond and a municipal bond, we know that the letter rating system is flawed because the historical percentages are drastically different.  This is something every investor should think about before investing in a AAA municipal bond.\n\nIn the end, we learned that each investor needs to determine their own risk and make judgments for themselves.  Remember the greatest risk is not knowing what you're doing.  So do your research and think about what credit scores actually mean.", "thumbnail_url": "https://i.ytimg.com/vi/cZAVGwTKEAQ/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "cZAVGwTKEAQ", "duration": 1, "position": 2, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "14-what-is-the-sp-rating"}, {"name": "15. What is a Yield Curve", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, students learned how to read a yield curve.  When looking at the yield curve, it has two major components - yield and term.  The yield is found on the y axis and it represents the amount of interest that we'll be paid for owning a particular bond.  The term is found on the x axis and it represents the duration we would hold the bond at the specified yield.\n\nAlthough reading a yield curve is fairly straight forward, many people fail to recognize its importance in determining the direction of the economy.  As you saw in the video, the yield curve is flat or slightly inverted when a financial market is at its peak.  Slightly before and after a market collapses, you would find the yield curve slope in a positive direction.\n\nWhen we move into Course 2, Unit 3, it'll be important to continue looking at the yield curve as we determine a metric for our \"zero risk\" investment - the 10 year federal note.", "thumbnail_url": "https://i.ytimg.com/vi/mXiwY_e4nC0/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "mXiwY_e4nC0", "duration": 1, "position": 3, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "15-what-is-a-yield-curve"}, {"name": "16. How to use a Bond Calculator", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, students learned how to apply the BuffettsBooks.com bond calculator.  We learned that as interest rates increase, the value of a bond decreases.  Similarly, when interest rates decrease, the value of a bond decreases.  \n\nWhen using the bond calculator, it becomes evident that the term of the security changes as it approaches the maturity.  Since a premium or discount paid for a bond cannot be recuperated through coupon payments, short term bonds are less affected by changes in interest rates compared to long term bonds.  This idea of changing interest rates can be taken advantage of by intelligent investors if they purchase high yielding long term bonds.  In order to find a high yielding, long term bond, an investor can implement the ideas learned in lesson 3 of this unit.", "thumbnail_url": "https://i.ytimg.com/vi/WUjKbmEY_Oo/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "WUjKbmEY_Oo", "duration": 1, "position": 4, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "16-how-to-use-a-bond-calculator"}, {"name": "17. Warren Buffett's Four Rules to Investing", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this very short lesson, we re-address Warren Buffett's Four Rules to Investing.  In the follow on lessons, we cover the details of each rule described.", "thumbnail_url": "https://i.ytimg.com/vi/vznvCNaAaXw/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "vznvCNaAaXw", "duration": 1, "position": 5, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "17-warren-buffetts-four-rules-to-investing"}, {"name": "18. Warren Buffett's 1st Rule - What is the Current Ratio and the Debt to Equity Ratio", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, students learned the importance of investing in vigilant leaders.  A vigilant leader is a manager that won't put your business in dangerous situations.  Business are just like people you know.  You probably have friends that take enormous financial risks and as a result find themselves in a lot of debt.  Business are no different.\n\nRight now, there a businesses around the world that manage their debt very poorly.  The best way to identify these types of businesses is through the two tools you learned in this lesson; the Debt to Equity Ratio and the Current Ratio.\n\nThe Debt to Equity ratio is found on the balance sheet.  To calculate the number, simply divided the total debt by the equity and it will give you the ratio.  This ratio is very important because it shows a potential owner (or shareholder) how much leverage a company has on it's business.  The lower the ratio is, the better for you as an owner.  When Warren Buffett invests in stocks, he typically likes to find debt to equity ratios that are lower than (0.50).  Depending on the specific sector, his tolerance for debt to equity may increase, but generally speaking this is the ratio he uses.\n\nThe Current ratio is also found on the balance sheet.  To calculate the number, simply divided the current assets by the current liabilities.  The Current assets are the cash or other assets the company will likely convert to cash during the next 12 months.  Likewise, the current liabilities are the debts that the company must pay in the next 12 months.  By comparing these two figures, a potential owner gets a great idea if the company will need to incur debt within the next 12 months.  If the current ratio is a 1.0, that means the company's current assets and liabilities are equal.  A number lower than 1.0 is bad and it means the company will most likely incur debt within the next 12 months.  A number above 1.0 means the company's assets will exceed the liabilities.  This is a good thing and what you want to find in a business.\n\nWhen Warren Buffett looks for a company to buy, he always tries to find a company with a current ratio above 1.5.", "thumbnail_url": "https://i.ytimg.com/vi/2ngO4jtyGlk/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "2ngO4jtyGlk", "duration": 1, "position": 6, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "18-warren-buffetts-1st-rule-what-is-the-current-ratio-and-the-debt-to-equity-ratio"}, {"name": "19. Warren Buffett's 2nd Rule - Understanding Capital Gains Tax", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\nIn this lesson, students learned the importance of buying an asset that they can hold for ever.  Buy purchasing a company that has long term prospects, the owner (or stock holder) doesn't have to continually pay capital gains tax.  When comparing the capital gains tax of a person that trades in the short term, it becomes very obvious that it's not advantageous.  \n\nBy purchasing a company with long term prospects, you're not only minimizing your capital gains tax, but you also enjoy the sustained earnings through time.", "thumbnail_url": "https://i.ytimg.com/vi/JgLKLs1D4Qk/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "JgLKLs1D4Qk", "duration": 1, "position": 7, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "19-warren-buffetts-2nd-rule-understanding-capital-gains-tax"}, {"name": "20. Warren Buffett's 3rd rule - A stock must be stable and understandable", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\nIn this lesson, students learned the importance of stability.  The most important reason why we must pick a stable stock is because we're unable to accurately predict the growth of the earnings without stability.  If a company has an unstable past, it is possible that their future will become stable - it's just less likely than a company that's already demonstrated those attributes.  I like to think that companies perform and act like individual people you might know.  Some people are very conservative and grow their assets at a nice and controlled pace.  Others do not.  As you look at that example, it becomes obvious that the person that manages their finances conservatively will be easier to predict future performance.  This is very important as we move to the next lesson and learn to calculate the intrinsic value of a stock.", "thumbnail_url": "https://i.ytimg.com/vi/zYr4X7Ps9dI/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "zYr4X7Ps9dI", "duration": 1, "position": 8, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "20-warren-buffetts-3rd-rule-a-stock-must-be-stable-and-understandable"}, {"name": "21. Warren Buffett Intrinsic Value Calculation - Rule 4", "description": "Learn more about Preston’s Intrinsic Value Course that teaches you step-by-step how to calculate the intrinsic value of a stock in 18 exclusive videos: https://www.theinvestorspodcast.com/product/intrinsic-value-course/\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\nUse the intrinsic Value Calculator at: \nhttp://www.buffettsbooks.com/intelligent-investor/stocks/intrinsic-value-calculator.html\n\nIn this lesson, students learned that the intrinsic value can be defined as the discounted value of the cash that can be taken out of a business during it's remaining life.  For us, we've defined the life as the next ten years.  This way, we can discount that cash by the 10 year federal note.  The Cash that we are taking out of the business is simply the dividends and the book value growth during the next 10 years.  Since these numbers need to be estimated, it's very important to ensure that Warren Buffett's third rule (a stock must be stable and understandable) is met.  \n\nWhen a company doesn't have a history of linear growth, estimating the cash that they will produce for the next ten years becomes more speculative.  When we look at the root of the intrinsic value calculator, it operates off of the same principals as a bond calculator.  Instead of using coupons, we substitute dividends.  And instead of using par value (or value at maturity) we estimate the book value of the business in 10 years.  The value that we use to discount the summation of the cash is simply the 10 year federal note.  \n\nAlthough the previous paragraph might sound confusing to some, it's application is fairly straight forward.  The reason Buffett says, \"Two people looking at the same set of facts, will almost inevitably come up with at least slightly different intrinsic value figures,\" is due to a difference in opinion of the future cash flows.  Since some investors are more conservative than others, their estimates of book value growth or dividend payments may be lower.  This will immediately change the intrinsic value.  Your job as an intelligent investor is to determine your own tolerance for risk and conservative estimates on how much money you will receive while owning the stock for a 10 year period.  \n\nIf you ever have difficulty understanding the material, simply click on the link for the forum above.  Be sure to sign-up for an account and ask any questions you might have. Just because you didn't understand something in this lesson, doesn't mean you have to simply give up on the process.\n\nIf you would like to learn more about how this calculator works, be sure to read this article published by Preston:  It is here:  http://ezinearticles.com/?How-to-Calculate-the-Intrinsic-Value-of-Stocks-Like-Warren-Buffett&id=7262028", "thumbnail_url": "https://i.ytimg.com/vi/S1wbCieoHs4/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "S1wbCieoHs4", "duration": 1, "position": 9, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "21-warren-buffett-intrinsic-value-calculation-rule-4"}, {"name": "22. What is Preferred Stock", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, Students learned about the fundamental aspects of preferred stock.  Although Preferred shares are a proportional ownership of equity in a company, the security performs more like a bond.  Although all preferred shares operate differently, we can general agree that the value of a preferred share is solely based on the financial health of the company issuing the stock and the dividend rate.  Unlike common shares, when a company has increased earnings and growth, the preferred stock won't change in market price.  The price of redemption for a preferred share is the face value, not a premium or discount from the book value.  \n\nBefore purchasing a preferred share, we learned it's very important to review the certificate of designation.  This document provides the investor the with all the specific information about how the preferred share operates.  Some key things to consider are the following:\n\nCumulative preferred Vs. Non-Cumulative Preferred\nPerpetual term Vs. a designated term\nThe Calculability of the preferred stock\nthe Adjustability of the interest rate", "thumbnail_url": "https://i.ytimg.com/vi/MEMMVBJuJ7s/maxresdefault.jpg", "published_at": "2012-05-30T14:25:34Z", "provider_id": "MEMMVBJuJ7s", "duration": 1, "position": 10, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "22-what-is-preferred-stock"}, {"name": "23. Calculate Yield to Call and How to buy Preferred Stock", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, we learned about the www.quantumonline.com website. This website is the best online preferred stock resource. It's free to belong to and it provides the most organized results for finding a potential company to buy. (Disclaimer: BuffettsBooks.com has no affiliation with this website).\n\nIt is the recommendation of BuffettsBooks.com that investors focus on the following types of preferred shares: \n\nCumulative preferred Vs. Non-Cumulative Preferred\nDesignated term Vs. a Perpetual term \nThe Calculability of the preferred stock\nThe Adjustability of the interest rate\n\n1. Look for Cumulative Preferred Stock: Cumulative shares will assure that the stock holder will eventually receive the dividend declared in the prospectus.\n\n2. Call Date: Look for a Preferred Stock that has a Call Date that meets your expectations. If you simply want a short term holding location for your capital, then find a preferred share that has a call date within the time frame you'd like to liquidate the security. Although many preferred shares are not repurchased on their call date, others are.\n\n3. Maturity Date: Many investors avoid preferred shares with no maturity date (especially when the economy is in a position with low interest rates). When a Preferred Share has no maturity date, the market price of the stock could continue to plummet if interest rates remain higher than the time the stock was purchased.\n\n4. Assess the Company's ability to make the payments: A really quick method for determining a company's ability to make dividend payments is to look at the Moody's or S&P rating. A more advanced method would involve looking at the common shares on the company and assessing its current debt loads and future earnings.\n\n5. Read the Prospectus: Always, Always, Always read this document before you buy any Preferred Stock.\n\n6. Assess the YTC: Once you find a company that meets all the criteria listed above, then you'll want to take a look at the Yield you might receive from now until it's callable. This is called the Yield to Call. As you can see, we've provided a calculator below that helps you determine this percent. \n\nThe important thing to remember when you're calculating the YTC is that it doesn't mean you'll absolutely make that return. This is only going to give you an idea of what you would make on the investment if the issuer actually called the security on the call date and paid on the dividends by that date.", "thumbnail_url": "https://i.ytimg.com/vi/jsq3CxOkBng/maxresdefault.jpg", "published_at": "2012-07-10T12:56:55Z", "provider_id": "jsq3CxOkBng", "duration": 1, "position": 11, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "23-calculate-yield-to-call-and-how-to-buy-preferred-stock"}, {"name": "24. Calculate Book Value with Preferred Stock", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\n\n\nIn this lesson, students learned the importance of Common Shareholder's equity and Preferred Shareholder's par value.  In order to properly assess the value of a common shareholder's equity we must always remember to subtract the par value of the preferred stock.  Although this might be a painful process for new investors, it's importance is paramount.  If an individual is interested in investing in such a company, you would need to assess this \"correct book value\" for previous periods in order to reasonably assess the common share holder's equity growth in a business.", "thumbnail_url": "https://i.ytimg.com/vi/sKiKmuLC6Ro/maxresdefault.jpg", "published_at": "2012-07-10T12:57:14Z", "provider_id": "sKiKmuLC6Ro", "duration": 1, "position": 12, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "24-calculate-book-value-with-preferred-stock"}, {"name": "25. What is Income Investing", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\n\nIn this lesson, students learned the importance of Income Investing. By employing the techniques of income investing, one can prepare themselves properly for retirement.  Since income investing is the process of picking stable stocks and bonds that pay decent dividends and coupons, the investor can benefit from the cash flow that's produced by these securities.  \n\nThe first way income investing provides benefits to the investor is through liquidity.  Since the investor will continually receive dividends or coupons, they then have the opportunity to reinvest that cash flow into the most undervalued asset each month.  This compounding cash flow is truly the essence of investing like Warren Buffett.  With an ever increasing cash flow, investors can take advantage of market conditions during spikes and valleys.  \n\nThe second way income investing provides benefits to the investor is during retirement.  Since most retirees may need to sell their investments in order to pay their monthly lifestyle expenses, income investing offers an alternative approach.  Since the retiree will receive quarterly and semi annual payments from these types of investments, they will continue to have a steady cash flow to meet their lifestyle expenses.  Although some retirees may need to pull from the principal, income investing will minimize that withdrawal.  \n\nIn the end, Income Investing creates more cash flow for the individual employing the technique.  It's Warren Buffett's opinion that purchasing dividend paying stocks is a very wise decision because of the continued and consistent cash flow that provides liquidity to reinvest your earnings.", "thumbnail_url": "https://i.ytimg.com/vi/IYGDeI4Mc48/maxresdefault.jpg", "published_at": "2012-07-10T12:58:08Z", "provider_id": "IYGDeI4Mc48", "duration": 1, "position": 13, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "25-what-is-income-investing"}, {"name": "27. How to read a cash flow statement", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, we evaluated the cash flow statement of Walmart, Sears, Intel, and Kodak. The lesson provides good and bad cash flow statements so students could see the difference between risky and healthy companies. One of the key factors learned in this lesson was the importance of the operating activity and the operating activities section of the statement. Since the investing and financing activity are dependent upon the operating activity, it became obvious this section is the lifeblood of any business.", "thumbnail_url": "https://i.ytimg.com/vi/IHWIzDcWWT8/maxresdefault.jpg", "published_at": "2012-07-10T12:59:18Z", "provider_id": "IHWIzDcWWT8", "duration": 1, "position": 14, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "27-how-to-read-a-cash-flow-statement"}, {"name": "26. What is a Cash Flow Statement", "description": "Download Preston's 1 page checklist for finding great stock picks: http://buffettsbooks.com/checklist\n\nPreston Pysh is the #1 selling Amazon author of two books on Warren Buffett.  The books can be found at the following location:\n\nhttp://www.amazon.com/gp/product/0982967624/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0982967624&linkCode=as2&tag=pypull-20&linkId=EOHYVY7DPUCW3WD4\n\nhttp://www.amazon.com/gp/product/1939370159/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1939370159&linkCode=as2&tag=pypull-20&linkId=XRE5CA2QJ3I2OWSW\n\n\nIn this lesson, students learned the importance of the Cash Flow Statement. This important document is used to help determine how money flows through a business. Prior to 1987, investors could only examine the health of a company from the income statement and balance sheet. Due to stricter regulations, publically traded companies are now required to also disclose the cash flow statement. \n\nThe cash flow statement is broken down into three categories. 1. Operating Activities: This is probably the most important section of the statement because it shows the money that's flowing into the business from the product or service that the company produces. Positive revenues listed on the cash flow statement from other activities are not sustainable in the long term, so that's why this section is so important. 2. Investing Activities: A negative number listed in this section would mean that the company is investing money. A positive number in this section would mean that the company sold an asset in order to generate money. Obviously its better to see a negative number show-up under this section because it implies that the company is continuing to invest the revernues that it produces. 3. Financing Activities: In this section, an investor can identify whether the business is try to raise money or pay off debts. A positive number in this section means the company is incuring debt or dilute the value of their shares. A negative number means the company is paying off debt or increasing the value of their shares (through a share buy back). Generally speaking its good to see a negative number under this section because it means the company is removing their leverage and creating a stronger position for their shareholders.\n\nThe Cash flow is a great document to help look at trends and how money flows through a business. Although the balance sheet and income statement are very useful documents for determining the intrinsic value of a stable company, the cash flow statement gives potential investors a glimps into the current conditions of the company and how they manage their resources.", "thumbnail_url": "https://i.ytimg.com/vi/35ucnSHf2m4/maxresdefault.jpg", "published_at": "2012-07-22T12:45:30Z", "provider_id": "35ucnSHf2m4", "duration": 1, "position": 15, "course": "course-2-stock-investing-like-warren-buffett-intermediate", "slug": "26-what-is-a-cash-flow-statement"}]